In [225]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os
import sklearn as skl

In [226]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import OneHotEncoder, StandardScaler, OrdinalEncoder
from sklearn.compose import ColumnTransformer
from sklearn.impute import SimpleImputer

In [227]:
import warnings
warnings.filterwarnings('ignore')

In [228]:
iris = pd.read_csv('iris.csv')

In [229]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [230]:
iris.isna().values.any()

False

In [231]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [232]:
df = iris.drop(columns='Id')

In [233]:
df.duplicated().sum()

3

In [234]:
df.drop_duplicates(inplace=True)

In [235]:
df.columns

Index(['SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [236]:
df.rename(columns={'Species':'Target'},inplace=True)

In [237]:
os.getcwd()

'd:\\files\\My_ML_DL_Chatbot\\data\\original_data\\classification'

In [238]:
df.to_csv('D://files/My_ML_DL_Chatbot/data/preprocessed_data/classification/Iris.csv')

## Breast_cancer

#### Target - diagnosis

#### M -  malignant - cancer

#### B -  Benign  - not cancer

In [239]:
breast_cancer = pd.read_csv('Breast_cancer.csv')
breast_cancer.head()

,id,diagnosis,radius_mean,texture_mean,perimeter_mean,area_mean,smoothness_mean,compactness_mean,concavity_mean,concave points_mean,...,texture_worst,perimeter_worst,area_worst,smoothness_worst,compactness_worst,concavity_worst,concave points_worst,symmetry_worst,fractal_dimension_worst,Unnamed: 32
0,842302,M,17.99,10.38,122.80,1001.0,0.11840,0.27760,0.3001,0.14710,...,17.33,184.60,2019.0,0.1622,0.6656,0.7119,0.2654,0.4601,0.11890,NaN
1,842517,M,20.57,17.77,132.90,1326.0,0.08474,0.07864,0.0869,0.07017,...,23.41,158.80,1956.0,0.1238,0.1866,0.2416,0.1860,0.2750,0.08902,NaN
2,84300903,M,19.69,21.25,130.00,1203.0,0.10960,0.15990,0.1974,0.12790,...,25.53,152.50,1709.0,0.1444,0.4245,0.4504,0.2430,0.3613,0.08758,NaN
3,84348301,M,11.42,20.38,77.58,386.1,0.14250,0.28390,0.2414,0.10520,...,26.50,98.87,567.7,0.2098,0.8663,0.6869,0.2575,0.6638,0.17300,NaN
4,84358402,M,20.29,14.34,135.10,1297.0,0.10030,0.13280,0.1980,0.10430,...,16.67,152.20,1575.0,0.1374,0.2050,0.4000,0.1625,0.2364,0.07678,NaN

In [240]:
breast_cancer.shape

(569, 33)

In [241]:
breast_cancer['diagnosis'].nunique()

2

In [242]:
breast_cancer['diagnosis'].value_counts()

diagnosis
B    357
M    212
Name: count, dtype: int64

In [243]:
breast_cancer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 569 entries, 0 to 568
Data columns (total 33 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       569 non-null    int64
 1   diagnosis                569 non-null    object
 2   radius_mean              569 non-null    float64
 3   texture_mean             569 non-null    float64
 4   perimeter_mean           569 non-null    float64
 5   area_mean                569 non-null    float64
 6   smoothness_mean          569 non-null    float64
 7   compactness_mean         569 non-null    float64
 8   concavity_mean           569 non-null    float64
 9   concave points_mean      569 non-null    float64
 10  symmetry_mean            569 non-null    float64
 11  fractal_dimension_mean   569 non-null    float64
 12  radius_se                569 non-null    float64
 13  texture_se               569 non-null    float64
 14  perimeter_se             569 non-null    float64
 15  area_se                  569 non-null    float64
 16  smoothness_se            569 non-null    float64
 17  compactness_se           569 non-null    float64
 18  concavity_se             569 non-null    float64
 19  concave points_se        569 non-null    float64
 20  symmetry_se              569 non-null    float64
 21  fractal_dimension_se     569 non-null    float64
 22  radius_worst             569 non-null    float64
 23  texture_worst            569 non-null    float64
 24  perimeter_worst          569 non-null    float64
 25  area_worst               569 non-null    float64
 26  smoothness_worst         569 non-null    float64
 27  compactness_worst        569 non-null    float64
 28  concavity_worst          569 non-null    float64
 29  concave points_worst     569 non-null    float64
 30  symmetry_worst           569 non-null    float64
 31  fractal_dimension_worst  569 non-null    float64
 32  Unnamed: 32              0 non-null      float64
dtypes: float64(31), int64(1), object(1)
memory usage: 146.8+ KB

In [244]:
breast_cancer.drop(columns=["Unnamed: 32","id"], inplace=True)

In [245]:
breast_cancer.isna().values.sum()

0

In [246]:
breast_cancer.duplicated().sum()

0

In [247]:
breast_cancer.rename(columns={'diagnosis':'Target'}, inplace=True)

In [248]:
columns = breast_cancer.columns
columns

Index(['Target', 'radius_mean', 'texture_mean', 'perimeter_mean', 'area_mean',
       'smoothness_mean', 'compactness_mean', 'concavity_mean',
       'concave points_mean', 'symmetry_mean', 'fractal_dimension_mean',
       'radius_se', 'texture_se', 'perimeter_se', 'area_se', 'smoothness_se',
       'compactness_se', 'concavity_se', 'concave points_se', 'symmetry_se',
       'fractal_dimension_se', 'radius_worst', 'texture_worst',
       'perimeter_worst', 'area_worst', 'smoothness_worst',
       'compactness_worst', 'concavity_worst', 'concave points_worst',
       'symmetry_worst', 'fractal_dimension_worst'],
      dtype='object')

In [249]:
breast_cancer = breast_cancer[['radius_mean', 'texture_mean', 'perimeter_mean', 'area_mean',
       'smoothness_mean', 'compactness_mean', 'concavity_mean',
       'concave points_mean', 'symmetry_mean', 'fractal_dimension_mean',
       'radius_se', 'texture_se', 'perimeter_se', 'area_se', 'smoothness_se',
       'compactness_se', 'concavity_se', 'concave points_se', 'symmetry_se',
       'fractal_dimension_se', 'radius_worst', 'texture_worst',
       'perimeter_worst', 'area_worst', 'smoothness_worst',
       'compactness_worst', 'concavity_worst', 'concave points_worst',
       'symmetry_worst', 'fractal_dimension_worst','Target']]

In [250]:
breast_cancer.head()

,radius_mean,texture_mean,perimeter_mean,area_mean,smoothness_mean,compactness_mean,concavity_mean,concave points_mean,symmetry_mean,fractal_dimension_mean,...,texture_worst,perimeter_worst,area_worst,smoothness_worst,compactness_worst,concavity_worst,concave points_worst,symmetry_worst,fractal_dimension_worst,Target
0,17.99,10.38,122.80,1001.0,0.11840,0.27760,0.3001,0.14710,0.2419,0.07871,...,17.33,184.60,2019.0,0.1622,0.6656,0.7119,0.2654,0.4601,0.11890,M
1,20.57,17.77,132.90,1326.0,0.08474,0.07864,0.0869,0.07017,0.1812,0.05667,...,23.41,158.80,1956.0,0.1238,0.1866,0.2416,0.1860,0.2750,0.08902,M
2,19.69,21.25,130.00,1203.0,0.10960,0.15990,0.1974,0.12790,0.2069,0.05999,...,25.53,152.50,1709.0,0.1444,0.4245,0.4504,0.2430,0.3613,0.08758,M
3,11.42,20.38,77.58,386.1,0.14250,0.28390,0.2414,0.10520,0.2597,0.09744,...,26.50,98.87,567.7,0.2098,0.8663,0.6869,0.2575,0.6638,0.17300,M
4,20.29,14.34,135.10,1297.0,0.10030,0.13280,0.1980,0.10430,0.1809,0.05883,...,16.67,152.20,1575.0,0.1374,0.2050,0.4000,0.1625,0.2364,0.07678,M

In [251]:
breast_cancer.to_csv('D://files/My_ML_DL_Chatbot/data/preprocessed_data/classification/BreastCancer.csv')

### Titanic Dataset

### Survival	

#### 0 = No, 1 = Yes

In [252]:
titanic_train = pd.read_csv('Titanic\\train.csv')

In [253]:
titanic_train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [254]:
titanic_train.shape

(891, 12)

In [255]:
titanic_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [256]:
titanic_train.drop(columns=['Cabin','Name','PassengerId'], inplace=True)

In [257]:
titanic_train.head(2)

   Survived  Pclass     Sex   Age  SibSp  Parch     Ticket     Fare Embarked
0         0       3    male  22.0      1      0  A/5 21171   7.2500        S
1         1       1  female  38.0      1      0   PC 17599  71.2833        C

In [258]:
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Ticket    891 non-null    object
 7   Fare      891 non-null    float64
 8   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [259]:
import re

def replace_values(val):
    if re.match(r'^\d+$', val):  
        return 1
    else:
        return 2

In [260]:
titanic_train['Ticket name'] = titanic_train['Ticket'].str.split(' ',expand=True)[0]
titanic_train['Ticket name'] = titanic_train['Ticket name'].apply(replace_values)

In [261]:
titanic_train.head(2)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Ticket name
0,0,3,male,22.0,1,0,A/5 21171,7.2500,S,2
1,1,1,female,38.0,1,0,PC 17599,71.2833,C,2

In [262]:
titanic_train.drop(columns=["Ticket",'Ticket name'], inplace=True)

In [263]:
titanic_train = titanic_train[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare','Embarked', 'Survived']]

In [264]:
titanic_train.rename(columns={'Survived': 'Target'},inplace=True)

In [265]:
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Embarked  889 non-null    object
 7   Target    891 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [266]:
titanic_train.to_csv('D://files/My_ML_DL_Chatbot/data/preprocessed_data/classification/Titanic.csv')

### Wine Quality Dataset

#### 0 to 10

In [267]:
wine = pd.read_csv('WineQT.csv')
wine.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1143 entries, 0 to 1142
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1143 non-null   float64
 1   volatile acidity      1143 non-null   float64
 2   citric acid           1143 non-null   float64
 3   residual sugar        1143 non-null   float64
 4   chlorides             1143 non-null   float64
 5   free sulfur dioxide   1143 non-null   float64
 6   total sulfur dioxide  1143 non-null   float64
 7   density               1143 non-null   float64
 8   pH                    1143 non-null   float64
 9   sulphates             1143 non-null   float64
 10  alcohol               1143 non-null   float64
 11  quality               1143 non-null   int64
 12  Id                    1143 non-null   int64
dtypes: float64(11), int64(2)
memory usage: 116.2 KB

In [268]:
wine.duplicated().sum()

0

In [269]:
wine.drop(columns='Id', inplace=True)
wine.head(2)

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.0,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.0,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5

In [270]:
wine.rename(columns={'quality':'Target'}, inplace=True)

In [271]:
wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,Target
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [272]:
from sklearn.preprocessing import LabelEncoder
len = LabelEncoder()
wine['Target'] = len.fit_transform(wine['Target'])

In [273]:
wine.tail()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,Target
1138,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,3
1139,6.8,0.620,0.08,1.9,0.068,28.0,38.0,0.99651,3.42,0.82,9.5,3
1140,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,2
1141,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,3
1142,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,2

In [274]:
wine.to_csv('D://files/My_ML_DL_Chatbot/data/preprocessed_data/classification/WineQT.csv')

# Credit score

In [275]:
credit = pd.read_csv('Credit_score.csv')
credit.head(2)

,id,customer_id,month,name,age,ssn,occupation,annual_income,monthly_inhand_salary,total_emi_per_month,...,num_credit_inquiries,credit_mix,outstanding_debt,credit_utilization_ratio,credit_history_age,payment_of_min_amount,amount_invested_monthly,payment_behaviour,monthly_balance,credit_score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.8434,49.574947,...,4,Good,809.98,26.82262,265,No,80.41530,High_spent_Small_value_payments,312.49408,2
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.8434,49.574947,...,4,Good,809.98,31.94496,266,No,118.28022,Low_spent_Large_value_payments,284.62915,2

In [276]:
credit.drop(columns=['id','customer_id', 'name','ssn'],inplace=True)

In [277]:
credit_mix_mapping = {'Good': 3,'Standard': 2,'Bad': 1}
credit['credit_mix'].replace(credit_mix_mapping, inplace=True)
payment_of_min_amount_mapping = {'Yes': 2,'No': 1}
credit['payment_of_min_amount'].replace(payment_of_min_amount_mapping, inplace=True)
credit[['credit_mix','payment_of_min_amount']] = credit[['credit_mix','payment_of_min_amount']].astype(int)

In [278]:
mapping = {
    'Low_spent_Small_value_payments': 1,
    'Low_spent_Medium_value_payments': 2,
    'Low_spent_Large_value_payments': 3,
    'High_spent_Small_value_payments': 4,
    'High_spent_Medium_value_payments': 5,
    'High_spent_Large_value_payments': 6,
}
# credit['payment_behaviour'] = credit['payment_behaviour'].map(mapping)
credit['payment_behaviour'].replace(mapping, inplace=True)

In [279]:
credit['type_of_loan'].unique(), credit['type_of_loan'].nunique()

(array(["['Auto Loan', 'Credit-Builder Loan', 'Personal Loan', 'Home Equity Loan']",
        "['Credit-Builder Loan']",
        "['Auto Loan', 'Auto Loan', 'Not Specified']", ...,
        "['Home Equity Loan', 'Auto Loan', 'Auto Loan', 'Auto Loan']",
        "['Payday Loan', 'Student Loan', 'Mortgage Loan', 'Not Specified']",
        "['Personal Loan', 'Auto Loan', 'Mortgage Loan', 'Student Loan', 'Student Loan']"],
       dtype=object),
 6261)

In [280]:
credit['type_of_loan'] = credit['type_of_loan'].str.replace("'", "").str.replace("[", "").str.replace("]", "")
loan_types = credit['type_of_loan'].str.get_dummies(sep=', ')
credit = pd.concat([credit, loan_types], axis=1).drop(columns=['type_of_loan'])

In [281]:
credit.rename(columns={'credit_score':'Target'}, inplace=True)
credit = credit[['month', 'age', 'occupation', 'annual_income', 'monthly_inhand_salary',
       'total_emi_per_month', 'num_bank_accounts', 'num_credit_card',
       'interest_rate', 'num_of_loan', 'delay_from_due_date',
       'num_of_delayed_payment', 'changed_credit_limit',
       'num_credit_inquiries', 'credit_mix', 'outstanding_debt',
       'credit_utilization_ratio', 'credit_history_age',
       'payment_of_min_amount', 'amount_invested_monthly', 'payment_behaviour',
       'monthly_balance', 'Auto Loan', 'Credit-Builder Loan',
       'Debt Consolidation Loan', 'Home Equity Loan', 'Mortgage Loan',
       'No Loan', 'Not Specified', 'Payday Loan', 'Personal Loan',
       'Student Loan', 'Target']]

In [282]:
credit.head(2)

,month,age,occupation,annual_income,monthly_inhand_salary,total_emi_per_month,num_bank_accounts,num_credit_card,interest_rate,num_of_loan,...,Credit-Builder Loan,Debt Consolidation Loan,Home Equity Loan,Mortgage Loan,No Loan,Not Specified,Payday Loan,Personal Loan,Student Loan,Target
0,January,23,Scientist,19114.12,1824.8434,49.574947,3,4,3,4,...,1,0,1,0,0,0,0,1,0,2
1,February,23,Scientist,19114.12,1824.8434,49.574947,3,4,3,4,...,1,0,1,0,0,0,0,1,0,2

In [283]:
credit.duplicated().sum()

0

In [284]:
credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 33 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   month                     100000 non-null  object
 1   age                       100000 non-null  int64
 2   occupation                100000 non-null  object
 3   annual_income             100000 non-null  float64
 4   monthly_inhand_salary     100000 non-null  float64
 5   total_emi_per_month       100000 non-null  float64
 6   num_bank_accounts         100000 non-null  int64
 7   num_credit_card           100000 non-null  int64
 8   interest_rate             100000 non-null  int64
 9   num_of_loan               100000 non-null  int64
 10  delay_from_due_date       100000 non-null  int64
 11  num_of_delayed_payment    100000 non-null  int64
 12  changed_credit_limit      100000 non-null  float64
 13  num_credit_inquiries      100000 non-null  int64
 14  credit_mix                100000 non-null  int32
 15  outstanding_debt          100000 non-null  float64
 16  credit_utilization_ratio  100000 non-null  float64
 17  credit_history_age        100000 non-null  int64
 18  payment_of_min_amount     100000 non-null  int32
 19  amount_invested_monthly   100000 non-null  float64
 20  payment_behaviour         100000 non-null  int64
 21  monthly_balance           100000 non-null  float64
 22  Auto Loan                 100000 non-null  int64
 23  Credit-Builder Loan       100000 non-null  int64
 24  Debt Consolidation Loan   100000 non-null  int64
 25  Home Equity Loan          100000 non-null  int64
 26  Mortgage Loan             100000 non-null  int64
 27  No Loan                   100000 non-null  int64
 28  Not Specified             100000 non-null  int64
 29  Payday Loan               100000 non-null  int64
 30  Personal Loan             100000 non-null  int64
 31  Student Loan              100000 non-null  int64
 32  Target                    100000 non-null  int64
dtypes: float64(8), int32(2), int64(21), object(2)
memory usage: 24.4+ MB

In [288]:
credit.to_csv('D://files/My_ML_DL_Chatbot/data/preprocessed_data/classification/CreditScore.csv')

In [ ]:
iris = pd.read_csv('data\classification\Original data\Breast_cancer.csv')
iris.head()
iris.shape
iris.isna().values.any()
iris.info()
credit['type_of_loan'].unique(), credit['type_of_loan'].nunique()
credit.rename(columns={'credit_score':'Target'}, inplace=True)
df = iris.drop(columns='Id')
df.duplicated().sum()
df.drop_duplicates(inplace=True)

payment_of_min_amount_mapping = {'Yes': 2,'No': 1}
credit['payment_of_min_amount'].replace(payment_of_min_amount_mapping, inplace=True)
credit[['credit_mix','payment_of_min_amount']] = credit[['credit_mix','payment_of_min_amount']].astype(int)

credit.to_csv('D://files/My_ML_DL_Chatbot/data/preprocessed_data/classification/CreditScore.csv')


https://www.kaggle.com/datasets/yasserh/wine-quality-dataset
https://www.kaggle.com/datasets/yasserh/titanic-dataset

### Human Age Dataset

In [178]:
age = pd.read_csv('data\classification\Original data\Human_age_pred\\train.csv')
age.head()

,Gender,Height (cm),Weight (kg),Blood Pressure (s/d),Cholesterol Level (mg/dL),BMI,Blood Glucose Level (mg/dL),Bone Density (g/cm²),Vision Sharpness,Hearing Ability (dB),...,Family History,Cognitive Function,Mental Health Status,Sleep Patterns,Stress Levels,Pollution Exposure,Sun Exposure,Education Level,Income Level,Age (years)
0,Male,171.148359,86.185197,151/109,259.465814,29.423017,157.652848,0.132868,0.200000,58.786198,...,NaN,44.059172,Good,Insomnia,2.797064,5.142344,7.108975,NaN,Medium,89
1,Male,172.946206,79.641937,134/112,263.630292,26.626847,118.507805,0.629534,0.267312,54.635270,...,Heart Disease,45.312298,Good,Normal,9.339930,7.272720,3.918489,Undergraduate,Medium,77
2,Female,155.945488,49.167058,160/101,207.846206,20.217553,143.587550,0.473487,0.248667,54.564632,...,Hypertension,56.246991,Poor,Insomnia,9.234637,8.500386,5.393408,NaN,Medium,70
3,Female,169.078298,56.017921,133/94,253.283779,19.595270,137.448581,1.184315,0.513818,79.722963,...,Hypertension,55.196092,Poor,Insomnia,4.693446,7.555511,2.745578,NaN,Low,52
4,Female,163.758355,73.966304,170/106,236.119899,27.582078,145.328695,0.434562,0.306864,52.479469,...,NaN,53.023379,Good,Normal,4.038537,9.429097,3.878435,Undergraduate,High,79

In [179]:
age.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 26 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Gender                       3000 non-null   object
 1   Height (cm)                  3000 non-null   float64
 2   Weight (kg)                  3000 non-null   float64
 3   Blood Pressure (s/d)         3000 non-null   object
 4   Cholesterol Level (mg/dL)    3000 non-null   float64
 5   BMI                          3000 non-null   float64
 6   Blood Glucose Level (mg/dL)  3000 non-null   float64
 7   Bone Density (g/cm²)         3000 non-null   float64
 8   Vision Sharpness             3000 non-null   float64
 9   Hearing Ability (dB)         3000 non-null   float64
 10  Physical Activity Level      3000 non-null   object
 11  Smoking Status               3000 non-null   object
 12  Alcohol Consumption          1799 non-null   object
 13  Diet                         3000 non-null   object
 14  Chronic Diseases             1701 non-null   object
 15  Medication Use               1802 non-null   object
 16  Family History               1549 non-null   object
 17  Cognitive Function           3000 non-null   float64
 18  Mental Health Status         3000 non-null   object
 19  Sleep Patterns               3000 non-null   object
 20  Stress Levels                3000 non-null   float64
 21  Pollution Exposure           3000 non-null   float64
 22  Sun Exposure                 3000 non-null   float64
 23  Education Level              2373 non-null   object
 24  Income Level                 3000 non-null   object
 25  Age (years)                  3000 non-null   int64
dtypes: float64(12), int64(1), object(13)
memory usage: 609.5+ KB